In [1]:
#Creating Dict
dict={"Name":"Anuja","Age":"22"}
dict

{'Name': 'Anuja', 'Age': '22'}

In [2]:
d={"Name":["Anuja","Arya","Angha"],"Age":[22,17,32],"City":["Pune","Sangli","Satara"]}
d

{'Name': ['Anuja', 'Arya', 'Angha'],
 'Age': [22, 17, 32],
 'City': ['Pune', 'Sangli', 'Satara']}

In [3]:
#creating Dataframe
import pandas as pd
pd.DataFrame(d)

    Name  Age    City
0  Anuja   22    Pune
1   Arya   17  Sangli
2  Angha   32  Satara

In [4]:
#Keys
d.keys()

dict_keys(['Name', 'Age', 'City'])

In [5]:
#values
d.values()

dict_values([['Anuja', 'Arya', 'Angha'], [22, 17, 32], ['Pune', 'Sangli', 'Satara']])

In [6]:
#items
d.items()

dict_items([('Name', ['Anuja', 'Arya', 'Angha']), ('Age', [22, 17, 32]), ('City', ['Pune', 'Sangli', 'Satara'])])

In [17]:
d["Gender"]=("f","f","f")
d

{'Name': ['Anuja', 'Arya', 'Angha'],
 'Age': [22, 17, 32],
 'City': ['Pune', 'Sangli', 'Satara'],
 'gender': ('f', 'f', 'f'),
 'Gender': ('f', 'f', 'f')}

In [18]:
import pandas as pd
pd.DataFrame(d)

    Name  Age    City gender Gender
0  Anuja   22    Pune      f      f
1   Arya   17  Sangli      f      f
2  Angha   32  Satara      f      f

In [22]:
#delete
del d["gender"]

In [23]:
d

{'Name': ['Anuja', 'Arya', 'Angha'],
 'Age': [22, 17, 32],
 'City': ['Pune', 'Sangli', 'Satara'],
 'Gender': ('f', 'f', 'f')}

In [25]:
#pop
d.pop("Age")

[22, 17, 32]

In [31]:
dict={"Id":1,"Sub":"CS"}
dict

{'Id': 1, 'Sub': 'CS'}

In [36]:
#update
dict.update({"Id":2})

In [37]:
dict

{'Id': 2, 'Sub': 'CS'}

In [38]:
#copy
d1=dict.copy()

In [39]:
d1

{'Id': 2, 'Sub': 'CS'}

In [40]:
#clear
d1.clear()

In [41]:
d1

{}